[
{"title": "Human KCNQ5 de novo mutations underlie epilepsy and intellectual disability", "authors": "Aguan D. Wei, Paul Wakenight, Theresa A. Zwingman, Angela M. Bard, Nikhil Sahai, Marjolein H. Willemsen, Helenius J. Schelhaas, Alexander P. A. Stegmann, Judith S. Verhoeven, Stella A. de Man, Marja W. Wessels, Tjitske Kleefstra, Deepali N. Shinde, Katherine L. Helbig, Alice Basinger, Victoria F. Wagner, David Rodriguez-Buritica, Emily Bryant, John J. Millichap, Kathleen J. Millen, William B. Dobyns, Jan-Marino Ramirez, Franck K. Kalume"},
{"title": "KCNQ5 activation is a unifying molecular mechanism shared by genetically and culturally diverse botanical hypotensive folk medicines", "authors": "Rían W. Manville, Jennifer van der Horst, Kaitlyn E. Redford, Benjamin B. Katz, Thomas A. Jepps, Geoffrey W. Abbott"},
{"title": "KCNQ5 Potassium Channel Activation Underlies Vasodilation by Tea", "authors": "Kaitlyn E. Redford, Salomé Rognant, Thomas A. Jepps, Geoffrey W. Abbott"},
{"title": "KCNQ2 and KCNQ5 form heteromeric channels independent of KCNQ3", "authors": "Heun Soh, Kristen Springer, Klarita Doci, Jeremy L. Balsbaugh, Anastasios V. Tzingounis"},
{"title": "KCNQ5 activation by tannins mediates vasorelaxant effects of barks used in Native American botanical medicine", "authors": "Rian W. Manville, Kaitlyn E. Redford, Jennifer van der Horst, Derk J. Hogenkamp, Thomas A. Jepps, Geoffrey W. Abbott"},
{"title": "The Changes of KCNQ5 Expression and Potassium Microenvironment in the Retina of Myopic Guinea Pigs", "authors": "Qin Yang, Qing Qing Tan, Chang Jun Lan, Bo Zhen Lv, Gui Mei Zhou, Wei Qi Zhong, Zhi Ming Gu, Yu Mei Mao, Xuan Liao"},
{"title": "Loss-of-function variants in the KCNQ5 gene are implicated in genetic generalized epilepsies", "authors": "Johanna Krüger, Julian Schubert, Josua Kegele, Audrey Labalme, Miaomiao Mao, Jacqueline Heighway, Guiscard Seebohm, Pu Yan, Mahmoud Koko, Kezban Aslan-Kara, Hande Caglayan, Bernhard J. Steinhoff, Yvonne G. Weber, Pascale Keo-Kosal, Samuel F. Berkovic, Michael S. Hildebrand, Steven Petrou, Roland Krause, Patrick May, Gaetan Lesca, Snezana Maljevic, Holger Lerche"},
{"title": "The KCNQ5 potassium channel mediates a component of the afterhyperpolarization current in mouse hippocampus", "authors": "Anastassios V. Tzingounis, Matthias Heidenreich, Tatjana Kharkovets, Guillermo Spitzmaul, Henrik S. Jensen, Roger A. Nicoll, Thomas J. Jentsch"},
{"title": "KCNQ5 and C9orf50 Methylation in Stool DNA for Early Detection of Colorectal Cancer", "authors": "Yaping Cao, Guodong Zhao, Mufa Yuan, Xiaoyu Liu, Yong Ma, Yang Cao, Bei Miao, Shuyan Zhao, Danning Li, Shangmin Xiong, Minxue Zheng, Sujuan Fei"},
{"title": "KCNQ5/Kv7.5 potassium channel expression and subcellular localization in primate retinal pigment epithelium and neural retina", "authors": "Xiaoming Zhang, Dongli Yang, Bret A. Hughes"},
{"title": "Loss of Auditory Activity Modifies the Location of Potassium Channel KCNQ5 in Auditory Brainstem Neurons", "authors": "Elena Caminos, Elisabet Garcia-Pino, Jose M Juiz"},
{"title": "Vestibular Role of KCNQ4 and KCNQ5 K+ Channels Revealed by Mouse Models", "authors": "Guillermo Spitzmaul, Leonardo Tolosa, Beerend H. J. Winkelman, Matthias Heidenreich, Maarten A. Frens, Christian Chabbert, Chris I. de Zeeuw, Thomas J. Jentsch"},
{"title": "CTCF Mediates the Cell-Type Specific Spatial Organization of the Kcnq5 Locus and the Local Gene Regulation", "authors": "Licheng Ren, Yang Wang, Minglei Shi, Xiaoning Wang, Zhong Yang, Zhihu Zhao"},
{"title": "Diclofenac Distinguishes among Homomeric and Heteromeric Potassium\n               Channels Composed of KCNQ4 and KCNQ5 Subunits", "authors": "Lioubov I. Brueggemann, Alexander R. Mackie, Jody L. Martin, Leanne L. Cribbs, Kenneth L. Byron"},
{"title": "Opposite regulation of KCNQ5 and TRPC6 channels contributes to vasopressin-stimulated calcium spiking responses in A7r5 vascular smooth muscle cells", "authors": "Bharath K. Mani, Lioubov I. Brueggemann, Leanne L. Cribbs, Kenneth L. Byron"},
{"title": "KCNQ5 channels control resting properties and release probability of a synapse", "authors": "Hai Huang, Laurence O. Trussell"},
{"title": "Gain of function due to increased opening probability by two KCNQ5 pore variants causing developmental and epileptic encephalopathy", "authors": "Mario Nappi, Vincenzo Barrese, Lidia Carotenuto, Gaetan Lesca, Audrey Labalme, Dorothee Ville, Thomas Smol, Mélanie Rama, Anne Dieux-Coeslier, Clotilde Rivier-Ringenbach, Maria Virginia Soldovieri, Paolo Ambrosino, Ilaria Mosca, Michael Pusch, Francesco Miceli, Maurizio Taglialatela"},
{"title": "Vasopressin stimulates action potential firing by protein kinase C-dependent inhibition of KCNQ5 in A7r5 rat aortic smooth muscle cells", "authors": "Lioubov I. Brueggemann, Christopher J. Moran, John A. Barakat, Jay Z. Yeh, Leanne L. Cribbs, Kenneth L. Byron"},
{"title": "Characterization of KCNQ5/Q3 potassium channels expressed in mammalian cells", "authors": "Alan D Wickenden, Anruo Zou, P Kay Wagoner, Tim Jegla"},
{"title": "Discovery of Novel Retigabine Derivatives as Potent\nKCNQ4 and KCNQ5 Channel Agonists with Improved Specificity", "authors": "Lei Wang, Guan-Hua Qiao, Hai-Ning Hu, Zhao-Bing Gao, Fa-Jun Nan"}
]